spec/vcr/SpreeEmerchantpayGenesis_GenesisProvider/emerchantpay_direct_processing/when_refund/with_proper_error_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://staging.gate.emerchantpay.net/process/example_token/
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_transaction>
          <transaction_type>refund</transaction_type>
          <transaction_id>sp-d3c8a-b9aa-4b27-9e43-0134fb7fa</transaction_id>
          <usage>Reference transaction via Spree eCommerce platform - Capture</usage>
          <remote_ip>127.0.0.1</remote_ip>
          <reference_id>ce67aa24ca6ac656684af4a302a6214d</reference_id>
          <amount>99</amount>
          <currency>EUR</currency>
        </payment_transaction>
    headers:
      Content-Type:
      - text/xml
      Content-Length:
      - '425'
      Authorization:
      - Basic example_credentials
      User-Agent:
      - 'Genesis Ruby Client 0.1.3. Network: GenesisRuby::Network::NetHttp'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Date:
      - Tue, 06 Feb 2024 12:08:46 GMT
      Vary:
      - Accept
      Etag:
      - W/"681d1210d611fa2b1f27187a2660da23"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 5affc356-dcbe-4232-85e5-738d2d0402ad
      X-Runtime:
      - '0.237709'
      Strict-Transport-Security:
      - max-age=631138519
      X-Frame-Options:
      - ALLOWALL
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Content-Security-Policy:
      - 'default-src https: ''self''; font-src ''self'' data:; img-src https: ''self''
        data:; script-src https: ''self'' ''unsafe-inline'' js-agent.newrelic.com
        bam.nr-data.net; style-src https: ''self'' ''unsafe-inline''; report-uri https://emerchantpay.report-uri.io/r/default/csp/enforce'
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 89e080073eb0b1994bdf36e195bf0172.cloudfront.net (CloudFront)
      X-Amz-Cf-Pop:
      - DUB56-P2
      X-Amz-Cf-Id:
      - 4Fk0VYl-Z-RO17uwyJ-Dd2zSjYeEH9XWaNrSHoYkf2SjUrVRv07p4w==
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_response>
          <status>error</status>
          <code>220</code>
          <message>Transaction failed, please contact support!</message>
          <technical_message>Invalid Terminal</technical_message>
        </payment_response>
  recorded_at: Tue, 06 Feb 2024 12:08:46 GMT
recorded_with: VCR 6.2.0
