spec/vcr/SpreeEmerchantpayGenesis_GenesisProvider/when_send_gateway_request/when_method_continue/with_redirect_url_after_3dsv2_continue_request.yml

---
http_interactions:
- request:
    method: put
    uri: https://staging.gate.emerchantpay.net/threeds/threeds_method/162d90bf750a62392b12a88010426ccd
    body:
      encoding: US-ASCII
      string: unique_id=162d90bf750a62392b12a88010426ccd&signature=4916705ad0ea285bf3440b79f0c09cc4e2071af804ca4dab4421bdc0d0e8945ebc1438a5709082c77a43dc82496a2967edbd070b70aa99455400155b3bc97140
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Content-Length:
      - '181'
      Authorization:
      - Basic example_credentials
      User-Agent:
      - 'Genesis Ruby Client 0.1.3. Network: GenesisRuby::Network::NetHttp'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Date:
      - Tue, 06 Feb 2024 16:11:51 GMT
      Vary:
      - Accept
      Etag:
      - W/"b63bc57ad9fe9e1e1e56828407a4bb58"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - a8de718b-2381-4a01-a3d5-da3f6c1582ec
      X-Runtime:
      - '2.434624'
      Strict-Transport-Security:
      - max-age=631138519
      X-Frame-Options:
      - ALLOWALL
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Content-Security-Policy:
      - 'default-src https: ''self''; font-src ''self'' data:; img-src https: ''self''
        data:; script-src https: ''self'' ''unsafe-inline'' js-agent.newrelic.com
        bam.nr-data.net; style-src https: ''self'' ''unsafe-inline''; report-uri https://emerchantpay.report-uri.io/r/default/csp/enforce'
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 da775efc0806eff8cd47a6e8449a4cda.cloudfront.net (CloudFront)
      X-Amz-Cf-Pop:
      - SOF50-C1
      X-Amz-Cf-Id:
      - NCBXHtXUUywye4Yt_uStCyuR_Xvort8azKPCzRp2qB05zqJavytXvA==
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_response>
          <transaction_type>authorize3d</transaction_type>
          <status>pending_async</status>
          <unique_id>162d90bf750a62392b12a88010426ccd</unique_id>
          <transaction_id>sp-8f095-212d-41f3-8c2c-5da0b1365</transaction_id>
          <consumer_id>156794</consumer_id>
          <technical_message>TESTMODE: No real money will be transferred!</technical_message>
          <message>TESTMODE: No real money will be transferred!</message>
          <redirect_url>https://staging.gate.emerchantpay.net/threeds/authentication/162d90bf750a62392b12a88010426ccd</redirect_url>
          <redirect_url_type>3ds_v2_challenge</redirect_url_type>
          <mode>test</mode>
          <timestamp>2024-02-06T16:10:19Z</timestamp>
          <descriptor>test</descriptor>
          <amount>11000</amount>
          <currency>EUR</currency>
          <threeds/>
          <sent_to_acquirer>false</sent_to_acquirer>
        </payment_response>
  recorded_at: Tue, 06 Feb 2024 16:11:51 GMT
recorded_with: VCR 6.2.0
