spec/vcr/SpreeEmerchantpayGenesis_GenesisProvider/when_send_gateway_request/when_purchase/with_proper_success_response_type.yml

---
http_interactions:
- request:
    method: post
    uri: https://staging.gate.emerchantpay.net/process/example_token/
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_transaction>
          <transaction_type>authorize3d</transaction_type>
          <transaction_id>sp-fb7f0-98fa-4c8b-90b7-e5b92ee59</transaction_id>
          <usage>Electronic transaction via Spree eCommerce platform</usage>
          <remote_ip>127.0.0.1</remote_ip>
          <amount>11000</amount>
          <currency>EUR</currency>
          <card_holder>Spree Commerce</card_holder>
          <card_number>4111111111111111</card_number>
          <expiration_month>12</expiration_month>
          <expiration_year>2025</expiration_year>
          <cvv>123</cvv>
          <notification_url>http://127.0.0.1:4000/api/v2/storefront/emerchantpay_notification</notification_url>
          <return_success_url>http://localhost:4000/orders/R976143115</return_success_url>
          <return_failure_url>http://localhost:4000/checkout/payment?order_number=R976143115</return_failure_url>
          <customer_email>gertrudis.mertz@ondricka.co.uk</customer_email>
          <customer_phone>88888888888</customer_phone>
          <billing_address>
            <first_name>John</first_name>
            <last_name>Smith</last_name>
            <address1>258 Norah Way</address1>
            <zip_code>21705</zip_code>
            <city>City</city>
            <state>Georgia</state>
            <country>CH</country>
          </billing_address>
          <shipping_address>
            <first_name>John</first_name>
            <last_name>Smith</last_name>
            <address1>9344 Ruecker Plains</address1>
            <zip_code>72560-4318</zip_code>
            <city>City</city>
            <state>Nevada</state>
            <country>AG</country>
          </shipping_address>
          <threeds_v2_params>
            <threeds_method>
              <callback_url>http://127.0.0.1:4000/api/v2/storefront/emerchantpay_threeds/status</callback_url>
            </threeds_method>
            <control>
              <device_type>browser</device_type>
              <challenge_window_size>full_screen</challenge_window_size>
              <challenge_indicator>mandate</challenge_indicator>
            </control>
            <purchase>
              <category>goods</category>
            </purchase>
            <merchant_risk>
              <shipping_indicator>stored_address</shipping_indicator>
              <delivery_timeframe>another_day</delivery_timeframe>
              <reorder_items_indicator>first_time</reorder_items_indicator>
            </merchant_risk>
            <card_holder_account>
              <creation_date>06-02-2024</creation_date>
              <update_indicator>current_transaction</update_indicator>
              <last_change_date>06-02-2024</last_change_date>
              <password_change_indicator>during_transaction</password_change_indicator>
              <password_change_date>06-02-2024</password_change_date>
              <shipping_address_usage_indicator>current_transaction</shipping_address_usage_indicator>
              <shipping_address_date_first_used>06-02-2024</shipping_address_date_first_used>
              <transactions_activity_last_24_hours>1</transactions_activity_last_24_hours>
            </card_holder_account>
            <browser>
              <accept_header>*/*</accept_header>
              <java_enabled>true</java_enabled>
              <language>en-GB</language>
              <color_depth>32</color_depth>
              <screen_height>400</screen_height>
              <screen_width>400</screen_width>
              <time_zone_offset>+0</time_zone_offset>
              <user_agent>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3) AppleWebKit/537.75.14 (KHTML, like Gecko) Version/7.0.3 Safari/7046A194A</user_agent>
            </browser>
          </threeds_v2_params>
        </payment_transaction>
    headers:
      Content-Type:
      - text/xml
      Content-Length:
      - '3233'
      Authorization:
      - Basic example_credentials
      User-Agent:
      - 'Genesis Ruby Client 0.1.3. Network: GenesisRuby::Network::NetHttp'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Date:
      - Tue, 06 Feb 2024 10:34:08 GMT
      Vary:
      - Accept
      Etag:
      - W/"63654ca72720aa773a031b495d466391"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - b8308c65-74a6-43ad-b4a3-2d65cf78b8ff
      X-Runtime:
      - '3.035874'
      Strict-Transport-Security:
      - max-age=631138519
      X-Frame-Options:
      - ALLOWALL
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Content-Security-Policy:
      - 'default-src https: ''self''; font-src ''self'' data:; img-src https: ''self''
        data:; script-src https: ''self'' ''unsafe-inline'' js-agent.newrelic.com
        bam.nr-data.net; style-src https: ''self'' ''unsafe-inline''; report-uri https://emerchantpay.report-uri.io/r/default/csp/enforce'
      X-Cache:
      - Miss from cloudfront
      Via:
      - 1.1 9666ae8886e757e257c5c6ae7493f5c6.cloudfront.net (CloudFront)
      X-Amz-Cf-Pop:
      - DUB56-P2
      X-Amz-Cf-Id:
      - g4-skPvn2aGY8JCiGs2eI-w7uPq3p_-UlWM13S2mNkP78wP1ddxE5Q==
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <payment_response>
          <transaction_type>authorize3d</transaction_type>
          <status>approved</status>
          <cvv_result_code>M</cvv_result_code>
          <authorization_code>048889</authorization_code>
          <retrieval_reference_number>403710166295</retrieval_reference_number>
          <scheme_response_code>00</scheme_response_code>
          <unique_id>5d87900a4dbd164eb8144e9b73b16cd5</unique_id>
          <transaction_id>sp-fb7f0-98fa-4c8b-90b7-e5b92ee59</transaction_id>
          <consumer_id>156766</consumer_id>
          <response_code>00</response_code>
          <technical_message>TESTMODE: No real money will be transferred!</technical_message>
          <message>TESTMODE: No real money will be transferred!</message>
          <mode>test</mode>
          <timestamp>2024-02-06T10:34:05Z</timestamp>
          <descriptor>test</descriptor>
          <amount>11000</amount>
          <currency>EUR</currency>
          <threeds>
            <eci>07</eci>
          </threeds>
          <sent_to_acquirer>true</sent_to_acquirer>
          <scheme_transaction_identifier>234567891234560</scheme_transaction_identifier>
        </payment_response>
  recorded_at: Tue, 06 Feb 2024 10:34:08 GMT
recorded_with: VCR 6.2.0
